{
  "emotions": {
    "happy": [
      {
        "text": "قُلْ بِفَضْلِ اللَّهِ وَبِرَحْمَتِهِ فَبِذَٰلِكَ فَلْيَفْرَحُوا هُوَ خَيْرٌ مِّمَّا يَجْمَعُونَ",
        "type": "quran",
        "story": "نزلت هذه الآية عندما كان المشركون يتفاخرون بأموالهم وأولادهم أمام المؤمنين. فأمر الله المؤمنين أن يفرحوا بفضله ورحمته بدلاً من الحزن على قلة المال. هذا الفرح الروحي أعظم من كل كنوز الدنيا وأكثر دواماً من أي سعادة مادية."
      },
      {
        "text": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ يَهْدِيهِمْ رَبُّهُم بِإِيمَانِهِمْ",
        "type": "quran",
        "story": "نزلت عندما سأل الصحابة عن مصير المؤمنين الصالحين في الآخرة. أخبرهم الله أنه سيهديهم إلى جنات النعيم بسبب إيمانهم. كان هذا الوعد مصدر فرح عظيم للمؤمنين الذين كانوا يواجهون صعوبات الحياة، فعلموا أن صبرهم وإيمانهم سيُكافأ بالسعادة الأبدية."
      },
      {
        "text": "مَنْ عَمِلَ صَالِحًا مِّن ذَكَرٍ أَوْ أُنثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً",
        "type": "quran",
        "story": "نزلت هذه الآية رداً على من ظن أن السعادة تقتصر على الرجال أو الأغنياء فقط. أكد الله أن الحياة الطيبة والسعادة الحقيقية متاحة لكل مؤمن يعمل صالحاً، ذكراً كان أم أنثى، غنياً أم فقيراً. هذا الوعد ملأ قلوب المؤمنين بالفرح والأمل."
      },
      {
        "text": "وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ طُوبَىٰ لَهُمْ وَحُسْنُ مَآبٍ",
        "type": "quran",
        "story": "سأل أحد الصحابة الرسول عن معنى السعادة الحقيقية في الإسلام. فنزلت هذه الآية تبشر المؤمنين بـ'الطوبى' وهي أعلى درجات السعادة والفرح. هذه البشارة جعلت المؤمنين يفرحون بإيمانهم ويستمرون في العمل الصالح رغم التحديات."
      },
      {
        "text": "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ",
        "type": "quran",
        "story": "جاء رجل فقير إلى النبي يشكو أنه لا يستطيع فعل أعمال كبيرة كالأغنياء. فنزلت هذه الآية تؤكد أن أصغر عمل خير له أجر عند الله. فرح الرجل كثيراً وأدرك أن بإمكانه كسب الأجر من خلال الأعمال البسيطة كإطعام طائر أو مساعدة جار."
      },
      {
        "text": "وَبَشِّرِ الصَّابِرِينَ الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ",
        "type": "quran",
        "story": "نزلت عندما فقد بعض المسلمين أحباءهم في المعارك وكانوا حزينين. علمهم الله أن الصبر والرضا بالقدر يحول الحزن إلى فرح روحي. من يقول 'إنا لله وإنا إليه راجعون' بصدق يجد السكينة والطمأنينة تحل محل الألم."
      },
      {
        "text": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
        "type": "quran",
        "story": "كان النبي يكثر من هذا الدعاء في طوافه حول الكعبة. علم أصحابه أن السعادة الحقيقية تشمل خير الدنيا والآخرة معاً. هذا الدعاء الشامل يجلب الفرح لأنه يطلب من الله كل ما يحتاجه الإنسان للسعادة الكاملة."
      },
      {
        "text": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
        "type": "hadith",
        "story": "عندما أراد النبي أن يودع معاذ بن جبل لليمن، أمسك بيده وعلمه هذا الدعاء قائلاً: 'يا معاذ، لا تدعن في دبر كل صلاة أن تقول...' كان معاذ يقول إن هذا الدعاء ملأ قلبه بالسعادة والقرب من الله، فالذكر والشكر والعبادة الحسنة هي مفاتيح السعادة الروحية."
      },
      {
        "text": "الْمُؤْمِنُ أَمْرُهُ كُلُّهُ خَيْرٌ، إِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَهُ، وَإِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَهُ",
        "type": "hadith",
        "story": "قال النبي هذا الحديث عندما رأى بعض أصحابه يحزنون على فقدان أموالهم في التجارة. أراد أن يعلمهم أن المؤمن الحق يجد السعادة في كل الأحوال: في النعمة يشكر فيزداد خيراً، وفي البلاء يصبر فيكفر الله عنه سيئاته. هذا المنظور الإيجابي يجعل المؤمن سعيداً دائماً."
      },
      {
        "text": "مَا أَصَابَ الْمُسْلِمَ مِنْ نَصَبٍ وَلاَ وَصَبٍ وَلاَ هَمٍّ وَلاَ حُزْنٍ حَتَّى الشَّوْكَةِ يُشَاكُهَا إِلاَّ كَفَّرَ اللَّهُ بِهَا مِنْ خَطَايَاهُ",
        "type": "hadith",
        "story": "عندما مرضت عائشة رضي الله عنها، جاء النبي يعودها وهي تتألم. قال لها هذا الحديث ليخفف عنها ويجعلها تفرح بمرضها. أخبرها أن كل ألم يصيبها، حتى وخزة الشوكة البسيطة، يكفر الله بها من ذنوبها. هذا جعلها تبتسم وتحمد الله على المرض."
      },
      {
        "text": "إِنَّ فِي الْجَنَّةِ شَجَرَةً يَسِيرُ الرَّاكِبُ فِي ظِلِّهَا مِائَةَ عَامٍ لاَ يَقْطَعُهَا",
        "type": "hadith",
        "story": "كان الصحابة يسألون النبي عن الجنة ونعيمها، فوصف لهم هذه الشجرة العظيمة. عندما سمعوا هذا الوصف، امتلأت قلوبهم بالفرح والشوق للجنة. كان أبو هريرة يقول: 'كلما تذكرت هذا الحديث، ازددت شوقاً للجنة وفرحاً بما وعدنا الله به.'"
      },
      {
        "text": "مَنْ قَالَ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ",
        "type": "hadith",
        "story": "جاء رجل إلى النبي يشكو كثرة ذنوبه ويطلب عملاً يسيراً يكفر بها. فعلمه النبي هذا التسبيح البسيط. عندما علم الرجل أن مائة تسبيحة تمحو ذنوباً كزبد البحر، فرح فرحاً شديداً وصار يسبح الله كثيراً. هذا العمل البسيط أصبح مصدر سعادة يومية له."
      },
      {
        "text": "إِذَا أَحَبَّ اللَّهُ عَبْدًا دَعَا جِبْرِيلَ فَقَالَ إِنِّي أُحِبُّ فُلاَنًا فَأَحِبَّهُ، فَيُحِبُّهُ جِبْرِيلُ ثُمَّ يُنَادِي فِي السَّمَاءِ",
        "type": "hadith",
        "story": "سأل أبو هريرة النبي عن علامات محبة الله للعبد. فحدثه النبي بهذا الحديث الذي يبين كيف تنتشر محبة الله للعبد في السماء ثم في الأرض. عندما سمع أبو هريرة هذا، فرح كثيراً وصار يجتهد في العبادة راجياً أن ينال محبة الله ومحبة الناس."
      },
      {
        "text": "الدُّنْيَا خَضِرَةٌ حُلْوَةٌ وَإِنَّ اللَّهَ مُسْتَخْلِفُكُمْ فِيهَا فَيَنْظُرُ كَيْفَ تَعْمَلُونَ",
        "type": "hadith",
        "story": "عندما فتحت مكة وأصبح المسلمون أقوياء أغنياء، خاف النبي أن ينشغلوا بالدنيا عن الآخرة. فحدثهم بهذا الحديث ليذكرهم أنه يمكنهم الاستمتاع بجمال الدنيا وحلاوتها، لكن مع تذكر أنها اختبار من الله. هذا التوازن جلب السعادة للمؤمنين دون إفراط أو تفريط."
      },
      {
        "text": "لاَ تَحْقِرَنَّ مِنَ الْمَعْرُوفِ شَيْئًا وَلَوْ أَنْ تَلْقَى أَخَاكَ بِوَجْهٍ طَلْقٍ",
        "type": "hadith",
        "story": "جاء رجل فقير إلى النبي يقول إنه لا يملك مالاً ليتصدق به ويساعد الناس. فقال له النبي هذا الحديث، مبيناً أن مجرد الابتسامة في وجه الآخرين هي صدقة وعمل خير. فرح الرجل لأنه أدرك أن بإمكانه فعل الخير بأبسط الطرق وأن الله يأجره على كل ابتسامة."
      },
      {
        "text": "مَنْ أَصْبَحَ مِنْكُمْ آمِنًا فِي سِرْبِهِ مُعَافًى فِي جَسَدِهِ عِنْدَهُ قُوتُ يَوْمِهِ فَكَأَنَّمَا حِيزَتْ لَهُ الدُّنْيَا",
        "type": "hadith",
        "story": "كان بعض الصحابة يحزنون لأنهم ليسوا أغنياء مثل تجار قريش. فحدثهم النبي بهذا الحديث ليعلمهم أن السعادة الحقيقية في الأمان والصحة وطعام اليوم. من ملك هذه الثلاث فقد ملك الدنيا كلها. هذا غير نظرتهم للسعادة وجعلهم يقدرون النعم البسيطة."
      },
      {
        "text": "عَجَبًا لأَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَهُ كُلَّهُ خَيْرٌ وَلَيْسَ ذَاكَ لأَحَدٍ إِلاَّ لِلْمُؤْمِنِ",
        "type": "hadith",
        "story": "قال النبي هذا الحديث عندما رأى صحابياً يبكي على موت ولده. أراد أن يعلمه أن المؤمن مميز عن غيره لأن كل ما يصيبه خير: إن أصابته نعمة شكر فازداد خيراً، وإن أصابته مصيبة صبر فكُفرت سيئاته. هذا المنظور الإيماني حول الحزن إلى فرح وقبول بقضاء الله."
      },
      {
        "text": "بَشِّرُوا وَلاَ تُنَفِّرُوا وَيَسِّرُوا وَلاَ تُعَسِّرُوا",
        "type": "hadith",
        "story": "عندما أرسل النبي معاذاً وأبا موسى إلى اليمن، أوصاهما بهذه الكلمات. أراد منهما أن ينشرا الفرح والتيسير بين الناس بدلاً من التشديد والتعسير. هذا الحديث أصبح منهج حياة للمسلمين في التعامل مع الآخرين، فنشر البشارة والتيسير يجلب السعادة للجميع."
      },
      {
        "text": "مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ",
        "type": "hadith",
        "story": "جاء رجل إلى النبي يشكو ضيق حاله وهمومه الكثيرة. فنصحه النبي بأن يساعد الآخرين في حل مشاكلهم، وحدثه بهذا الحديث. طبق الرجل النصيحة وصار يساعد الناس، فوجد أن مساعدة الآخرين تفرج همومه وتملأ قلبه بالسعادة، بالإضافة إلى الأجر العظيم عند الله."
      },
      {
        "text": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ",
        "type": "hadith",
        "story": "علم النبي عائشة هذا الدعاء الجامع عندما سألته عن أفضل الأدعية. قال لها إن هذا الدعاء يشمل كل خير في الدنيا والآخرة، ما تعلمينه وما لا تعلمينه. كانت عائشة تقول إن هذا الدعاء يملأها بالثقة والفرح لأنها تطلب من الله كل خير ممكن."
      },
      {
        "text": "أَحِبُّوا اللَّهَ لِمَا يَغْذُوكُمْ بِهِ مِنْ نِعَمِهِ وَأَحِبُّونِي لِحُبِّ اللَّهِ",
        "type": "hadith",
        "story": "قال النبي هذا الحديث لأصحابه عندما تحدثوا عن محبتهم له. أراد أن يعلمهم أن المحبة الحقيقية تبدأ بمحبة الله لنعمه الكثيرة، ثم محبة رسوله لمحبة الله. هذا الترتيب في المحبة يجلب السعادة الروحية العميقة ويقوي العلاقة بالله ورسوله."
      },
      {
        "text": "إِنَّ اللَّهَ طَيِّبٌ لاَ يَقْبَلُ إِلاَّ طَيِّبًا",
        "type": "hadith",
        "story": "عندما سأل سعد بن أبي وقاص النبي عن شروط إجابة الدعاء، ذكر له هذا الحديث ضمن شروط أخرى. بين له أن الله طيب يحب الطيب من الأعمال والأقوال والأطعمة. هذا التعليم جعل سعداً يحرص على طيب المأكل والمشرب والعمل، مما جلب له السعادة والقرب من الله."
      },
      {
        "text": "كُلُّ مَعْرُوفٍ صَدَقَةٌ",
        "type": "hadith",
        "story": "جاء رجل فقير إلى النبي يشكو أنه لا يجد مالاً يتصدق به. فبشره النبي بأن كل عمل معروف هو صدقة: كلمة طيبة، مساعدة عابر طريق، إزالة أذى من الطريق. فرح الرجل لأنه أدرك أن بإمكانه التصدق كل يوم بأعمال بسيطة، وأن الله يأجره على كل معروف يفعله."
      },
      {
        "text": "الْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ",
        "type": "hadith",
        "story": "عندما مر النبي برجل يسب آخر في السوق، نهاه وقال له هذا الحديث. علمه أن الكلمة الطيبة لها أجر الصدقة، فلماذا يضيع الأجر بالكلام السيئ؟ تأثر الرجل بالحديث وصار يحرص على الكلام الطيب، فوجد أن هذا جلب له السعادة في علاقاته مع الناس والأجر من الله."
      },
      {
        "text": "التَّبَسُّمُ فِي وَجْهِ أَخِيكَ صَدَقَةٌ",
        "type": "hadith",
        "story": "كان أحد الصحابة عابس الوجه قليل الابتسام. فحدثه النبي بهذا الحديث ليشجعه على الابتسام. أخبره أن الابتسامة البسيطة لها أجر الصدقة وتدخل السرور على الآخرين. بدأ الرجل بالابتسام أكثر، فلاحظ أن الناس أصبحوا يحبونه أكثر وأنه يشعر بسعادة أكبر في تعامله معهم."
      },
      {
        "text": "مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ",
        "type": "hadith",
        "story": "قال النبي هذا الحديث عندما اشتكى إليه بعض الناس من انتشار الغيبة والنميمة في المدينة. علمهم أن المؤمن الحق يختار كلماته بعناية: إما خير أو صمت. هذا الأدب في الكلام يجلب السعادة للمتكلم والمستمع، ويحفظ العلاقات الطيبة بين الناس."
      },
      {
        "text": "أَكْثِرُوا مِنْ قَوْلِ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ فَإِنَّهَا مِنْ كُنُوزِ الْجَنَّةِ",
        "type": "hadith",
        "story": "عندما اشتكى أبو موسى الأشعري للنبي من ثقل التكاليف والمسؤوليات، علمه النبي هذا الذكر. أخبره أنه كنز من كنوز الجنة يعين المؤمن على تحمل أعباء الحياة. صار أبو موسى يكثر من هذا الذكر، فوجد راحة نفسية عجيبة وقوة في مواجهة التحديات."
      },
      {
        "text": "أَلاَ أُخْبِرُكُمْ بِأَحَبِّ الْكَلاَمِ إِلَى اللَّهِ؟ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
        "type": "hadith",
        "story": "سأل سمرة بن جندب النبي عن أحب الكلام إلى الله ليكثر منه. فأخبره النبي أن 'سبحان الله وبحمده' هو أحب الكلام إلى الله. فرح سمرة كثيراً لأنه وجد كلماتاً بسيطة يمكنه قولها في أي وقت وهي أحب الكلام إلى الله. صار يرددها كثيراً وهو مسرور."
      },
      {
        "text": "أَفْضَلُ الذِّكْرِ لاَ إِلَهَ إِلاَّ اللَّهُ",
        "type": "hadith",
        "story": "جاء جابر بن عبد الله يسأل النبي عن أفضل الأذكار ليداوم عليه. فأخبره النبي أن 'لا إله إلا الله' هي أفضل الذكر وأعظمه أجراً. كان جابر يقول: 'لما علمت أن هذه الكلمة هي أفضل الذكر، ما تركتها تغيب عن لساني، وما أسعدني بهذا الذكر العظيم!'"
      },
      {
        "text": "مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ عَشْرَ مَرَّاتٍ كَانَ كَمَنْ أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ",
        "type": "hadith",
        "story": "سأل رجل فقير النبي عن عمل له أجر عتق الرقاب لكنه لا يملك مالاً. فعلمه النبي هذا الذكر العظيم. عندما علم الرجل أن عشر تهليلات تعدل عتق أربعة أنفس، فرح فرحاً شديداً وصار يكثر من هذا الذكر، فوجد سعادة عظيمة في قلبه وطمأنينة لا توصف."
      }
    ]
  }
}